m-okada/QV08/emu/ARM/kinetis_workspace/Q8Emu_KV58_SDK12/SDK/platform/system/src/clock/fsl_clock_manager.c
/*FUNCTION******************************************************************************
 *
 * Function name : CLOCK_SYS_SetMcgMode
 * Description  : This function sets MCG to some target mode defined by the configure
 * structure, if can not switch to target mode directly, this function will choose
 * the proper path. If external clock is used in the target mode, please make sure
 * it is enabled, for example, if the external oscillator is used, please setup EREFS/HGO
 * correctly and make sure OSCINIT is set.
 * This function is used by clock dynamic setting, it only supports some specific
 * mode transitions, including:
 * 1. FEI      ==>    FEE/PEE
 * 2. BLPI    <==>    FEE/PEE
 * 3. Reconfigure PLL in PEE mode.
 * 4. Reconfigure FLL in FEE mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_SetMcgMode(mcg_config_t const *targetConfig,
                                      void (* fllStableDelay)(void))
{
    uint32_t outClkFreq;
#if FSL_FEATURE_MCG_HAS_PLL
    /* Current mode is only used for PEE mode transition. */
    mcg_modes_t curMode;  // Current MCG mode.
#endif

#if FSL_FEATURE_MCG_USE_OSCSEL
    mcg_oscsel_select_t oscsel = targetConfig->oscsel;
#else
    mcg_oscsel_select_t oscsel = kMcgOscselOsc;
#endif

#if FSL_FEATURE_MCG_HAS_PLL
#if (FSL_FEATURE_MCG_HAS_PLL1 || FSL_FEATURE_MCG_HAS_EXTERNAL_PLL)
    mcg_pll_clk_select_t pllcs = targetConfig->pllcs;
#else
    mcg_pll_clk_select_t pllcs = kMcgPllClkSelPll0;
#endif
#endif

#if FSL_FEATURE_MCG_HAS_PLL
    curMode = CLOCK_HAL_GetMcgMode(MCG);
#endif

    if (kMcgModeBLPI == targetConfig->mcg_mode)
    {
#if FSL_FEATURE_MCG_HAS_PLL
        // If current mode is PEE mode, swith to FBE mode first.
        if (kMcgModePEE == curMode)
        {
            CLOCK_SYS_SetMcgPeeToFbe();
        }
#endif
        // Change to FBI mode.
        CLOCK_HAL_SetFbiMode(MCG,
                             targetConfig->drs,
                             targetConfig->ircs,
                             targetConfig->fcrdiv,
                             fllStableDelay,
                             &outClkFreq);

        // Enable low power mode to enter BLPI.
        CLOCK_HAL_SetLowPowerModeCmd(MCG, true);
    }
    else if (kMcgModeFEE == targetConfig->mcg_mode)
    {
#if FSL_FEATURE_MCG_HAS_PLL
        // If current mode is PEE mode, swith to FBE mode first.
        if (kMcgModePEE == curMode)
        {
            CLOCK_SYS_SetMcgPeeToFbe();
        }
#endif
        // Disalbe low power mode.
        CLOCK_HAL_SetLowPowerModeCmd(MCG, false);
        // Configure FLL in FBE mode then switch to FEE mode.
        CLOCK_HAL_SetFbeMode(MCG,
                             oscsel,
                             targetConfig->frdiv,
                             targetConfig->dmx32,
                             targetConfig->drs,
                             fllStableDelay,
                             &outClkFreq);
        // Change CLKS to enter FEE mode.
        CLOCK_HAL_SetClkOutSrc(MCG, kMcgClkOutSrcOut);
        while (CLOCK_HAL_GetClkOutStat(MCG) != kMcgClkOutStatFll) {}
    }
#if FSL_FEATURE_MCG_HAS_PLL
    else if (kMcgModePEE == targetConfig->mcg_mode)
    {
        /*
         * If current mode is FEI/FEE/BLPI, then switch to FBE mode first.
         * If current mode is PEE mode, which means need to reconfigure PLL,
         * fist switch to PBE mode and configure PLL, then switch to PEE.
         */

        if (kMcgModePEE != curMode)
        {
            // Disalbe low power mode.
            CLOCK_HAL_SetLowPowerModeCmd(MCG, false);

            // Change to FBE mode.
            CLOCK_HAL_SetFbeMode(MCG,
                                 oscsel,
                                 targetConfig->frdiv,
                                 targetConfig->dmx32,
                                 targetConfig->drs,
                                 fllStableDelay,
                                 &outClkFreq);
        }

        // Change to PBE mode.
        CLOCK_HAL_SetPbeMode(MCG,
                             oscsel,
                             pllcs,
                             targetConfig->prdiv0,
                             targetConfig->vdiv0,
                             &outClkFreq);

        // Set CLKS to enter PEE mode.
        CLOCK_HAL_SetClkOutSrc(MCG, kMcgClkOutSrcOut);
        while (CLOCK_HAL_GetClkOutStat(MCG) != kMcgClkOutStatPll) {}
    }
#endif
    else
    {
        return kMcgModeErrModeUnreachable;
    }

    /* Enable MCGIRCLK. */
    CLOCK_HAL_SetInternalRefClkEnableCmd(MCG, targetConfig->irclkEnable);
    CLOCK_HAL_SetInternalRefClkEnableInStopCmd(MCG, targetConfig->irclkEnableInStop);

    /* Configure MCGIRCLK. */
    if (targetConfig->irclkEnable)
    {
        if (kMcgIrcFast == targetConfig->ircs)
        {
            /* Update FCRDIV if necessary. */
            CLOCK_HAL_UpdateFastClkInternalRefDiv(MCG, targetConfig->fcrdiv);
        }

        CLOCK_HAL_SetInternalRefClkMode(MCG, targetConfig->ircs);
        while (targetConfig->ircs != CLOCK_HAL_GetInternalRefClkMode(MCG)) {}
    }

#if FSL_FEATURE_MCG_HAS_PLL
    /* Enable PLL0. */
    if (targetConfig->pll0EnableInFllMode)
    {
        CLOCK_HAL_EnablePll0InFllMode(MCG,
                                      targetConfig->prdiv0,
                                      targetConfig->vdiv0,
                                      targetConfig->pll0EnableInStop);
    }
    else
    {
        CLOCK_HAL_SetPll0EnableCmd(MCG, false);
    }
#endif

    return kMcgModeErrNone;
}

#endif

#if (defined(CLOCK_USE_SCG))  // USE SCG

#else

#if (defined(CLOCK_USE_MCG_LITE)) // USE MCG_LITE

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_OscInit
 * Description   : Initialize OSC.
 *
 * This function initializes OSC according to configuration.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_OscInit(uint32_t instance,
                                             osc_user_config_t *config)
{
    assert(instance < OSC_INSTANCE_COUNT);
    uint32_t capacitorMask = 0U;

